# 1. Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных
# каждого элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать
# у пользователя, а указать явно, в программе.

list_1 = [1, 2, 3, 4, 'a', 'b', 'c', 'd']
def types(element):
    for element in range(len(list_1)):
        print('Элемент массива - ', list_1.index(list_1[element]) + 1, type(list_1[element]))
    return
types(list_1)