# 6. * Реализовать структуру данных «Товары». Она должна представлять собой список кортежей. Каждый кортеж
# хранит информацию об отдельном товаре. В кортеже должно быть два элемента — номер товара и словарь с параметрами,
# то есть характеристиками товара: название, цена, количество, единица измерения. Структуру нужно сформировать
# программно, запросив все данные у пользователя.
# Пример готовой структуры:#
# [
# (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
# (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
# (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
# ]#
# Нужно собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара,
# например, название. Тогда значение — список значений-характеристик, например, список названий товаров.
# Пример:#
# {
# “название”: [“компьютер”, “принтер”, “сканер”],
# “цена”: [20000, 6000, 2000],
# “количество”: [5, 2, 7],
# “ед”: [“шт.”]
# }
tov_1 = int(input("Укажите количество товарных единиц: "))

n = 1
dict_1 = []
list_1 = []
analit_1 = {}

while n <= tov_1:
    dict_1 = dict({'название': input("Введите название товарной позиции: "),
                   'цена': input("Введите цену товарной позиции: "),
                   'количество': input("Введите наличие единиц товарной позиции: "),
                   'eд': input("Введите единицу измерения единиц наличия: ")})
    list_1.append((n, dict_1))
    analit_1[n] = dict(
        {'название': dict_1.get('название'), 'цена': dict_1.get('цена'), 'количество': dict_1.get('количество'),
         'eд': dict_1.get('eд')})
    n += 1
for element in range(len(list_1)):
    print(list_1[element])
for key, value in analit_1.items():
    print(f'{key}: {value}')
