# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Выполните возведение числа x в степень y. Задание реализуйте в виде функции my_func(x, y).
# При решении задания нужно обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью
# оператора **. Второй — более сложная реализация без оператора **, предусматривающая использование цикла.

def step_1(ch_1, ch_2):
    return ch_1 ** ch_2


def step_2(ch_1, ch_2):
    n = 1
    rez = 1
    ch_3 = abs(ch_2)
    while n <= ch_3:
        rez = rez * ch_1
        n += 1
    return 1 / rez


ch_x = int(input("Введите число, необходимое возвести в степень (действительное положительное число): "))
ch_y = int(input("Введите значение степени (целое отрицательное число): "))

print(f'Результат (первый вариант): {step_1(ch_x, ch_y)}')
print(f'Результат (второй вариант): {step_2(ch_x, ch_y)}')