# 1. Поработайте с переменными, создайте несколько, выведите на экран. Запросите у пользователя некоторые числа и
# строки и сохраните в переменные, затем выведите на экран.

var_1 = 10
var_2 = 11
var_3 = 12
var_4 = 13
var_5 = 14

print('Первое число ', var_1)
print('Второе число ', var_2)
print('Третье число ', var_3)
print('Четвёртое число ', var_4)
print('Пятое число ', var_5)

num_1 = input('Введите переменную: ')
num_2 = input('Введите переменную: ')
num_3 = input('Введите переменную: ')
line_1 = input('Введите строку: ')
line_2 = input('Введите строку: ')
line_3 = input('Введите строку: ')

print('Первое введённое число ', num_1)
print('Второе введённое число ', num_2)
print('Третье введённое число ', num_3)
print('Первая введённая строка ', line_1)
print('Вторая введённая строка ', line_2)
print('Третья введённая строка ', line_3)
