# 2. Пользователь вводит время в секундах. Переведите время в часы, минуты, секунды и выведите в формате чч:мм:сс.
# Используйте форматирование строк.

time = int(input('Введите количество секунд: '))
time_1 = time % 60      # секунды
time_4 = time // 60
time_3 = time_4 // 60   # часы
time_2 = time_4 % 60    # минуты

print(f"Приведённое время в формате чч:мм:сс: {time_3:02}:{time_2:02}:{time_1:02}")

