# 4. Пользователь вводит целое положительное число. Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

var_1 = abs(int(input('Введите целое положительное число: ')))

max = var_1 % 10
while var_1 >= 1:
    var_1 = var_1 // 10
    if var_1 % 10 > max:
        max = var_1 % 10
    else:
        continue

print('Максимальная цифра введённого числа: ', max)


