# 6. Реализовать:
# итератор, повторяющий элементы некоторого списка, определённого заранее. Подсказка: используйте функцию
# count() и cycle() модуля itertools. Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Предусмотрите условие его завершения. #### Например, в первом задании выводим целые числа, начиная с 3.
# При достижении числа 10 — завершаем цикл. Вторым пунктом необходимо предусмотреть условие,
# при котором повторение элементов списка прекратится.

from itertools import cycle, count

first = int(input("Начальное значение: "))
last = first * first

list_1 = [i for i in range(last)]
count = 0
for b in cycle(list_1):
    if count < last + 10:
        print(b)
        count += 1
    else:
        break
