# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой строки.
# Строки нужно пронумеровать. Если слово длинное, выводить только первые 10 букв в слове.

str_1 = input("Введите строку неограниченной длины (наборы символов разделяйте пробелами): ")

n = 1
rez = []

for element in range(str_1.count(' ') + 1):
    rez = str_1.split()
    print(f"{n} {rez [element] [0:10]}")
    n += 1
