# 6. Если фирма отработала с прибылью, вычислите рентабельность выручки. Это отношение прибыли к выручке.
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчёте на одного сотрудника.

income = int(input('Укажите вашу выручку за прошедший расчётный период: '))
cons = int(input('Укажите понесённые издержки за прошедший расчётный период: '))

if income > cons:
    print("Всё хорошо! Продолжайте работать в том же темпе!")
    print(f"Ваша рентабельность: {income / cons:.2f}.")
    peoples = int(input('Укажите количество сотрудников вашей организации: '))
    print(f"Ваша прибыльл из расчёта на каждого сотрудника составила: {(income - cons) / peoples:.2f}.")
elif income == cons:
    print("Пора что-то менять!")
else:
    print("По-моему вам стоит подумать о смене рода деятельности!")

