# 1. Создать класс TrafficLight (светофор).
# определить у него один атрибут color (цвет) и метод running (запуск);
# атрибут реализовать как приватный;
# в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
# продолжительность первого состояния (красный) составляет 7 секунд, второго (жёлтый) — 2 секунды,
# третьего (зелёный) — на ваше усмотрение;
# переключение между режимами должно осуществляться только в указанном порядке (красный, жёлтый, зелёный);
# проверить работу примера, создав экземпляр и вызвав описанный метод.
# Задачу можно усложнить, реализовав проверку порядка режимов.
# При его нарушении выводить соответствующее сообщение и завершать скрипт.

from time import sleep
from datetime import datetime as dt


class TrafficLight:
    _modes = {'КРАСНЫЙ': 7, 'ЖЁЛТЫЙ': 2, 'ЗЕЛЁНЫЙ': 13}
    _color = ''

    def running(self):
        for color, sw_time in self._modes.items():
            self._color = color
            start_state_time = dt.now()
            print(f"Светофор перешёл в состояние {self._color} на {sw_time} секунд(ы).")
            sleep(sw_time)


if __name__ == '__main__':
    lights = TrafficLight()
    lights.running()