# 5. Реализовать структуру «Рейтинг», представляющую собой набор натуральных чисел, который не возрастает.
# У пользователя нужно запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с одинаковыми
# значениями, то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввёл число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввёл число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввёл число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать сразу в коде, например, my_list = [7, 5, 3, 3, 2].
my_list = [7, 5, 3, 3, 2]
print(f"Рейтинг: {my_list}")
dig_1 = int(input("Добавьте число в рейтинг: "))
for element in range(len(my_list)):
    if my_list[element] == dig_1:
        my_list.insert(element + 1, dig_1)
        break
    elif my_list[0] < dig_1:
        my_list.insert(0, dig_1)
    elif my_list[-1] > dig_1:
        my_list.append(dig_1)
    elif my_list[element] > dig_1 and my_list[element + 1] < dig_1:
        my_list.insert(element + 1, dig_1)
print(f"Пользователь ввёл число {dig_1}. Результат: {my_list}")