# 2. Выполнить функцию, которая принимает несколько параметров, описывающих данные пользователя:
# имя, фамилия, год рождения, город проживания, email, телефон. Функция должна принимать параметры как
# именованные аргументы. Осуществить вывод данных о пользователе одной строкой.

def my_func_1(name, surname, year, city, email, phone):
    name = input("Введите имя: ")
    surname = input("Введите фамилию: ")
    year = input("Введите год рождения: ")
    city = input("Введите город проживания: ")
    email = input("Введите адрес электронной почты: ")
    phone = input("Введите номер телефона: ")
    return ' '.join([name, surname, year, city, email, phone])


print(my_func_1(surname='', name='', year='', city='', email='', phone=''))