# 5. Создать (программно) текстовый файл, записать в него программно набор чисел, разделённых пробелами.
# Программа должна подсчитывать сумму чисел в файле и выводить её на экран.

def folding():
    try:
        with open("file_1.txt", "w+") as file_1:
            line = input("Введите набор чисел, разделённых пробелом: ")
            file_1.writelines(line)
            my_numb = line.split()
            print("Сумма всех введённых чисел:", sum(map(int, my_numb)))
    except IOError:
        print("Файл содержит ошибку.")
    except ValueError:
        print("Ввод не корректен. Внимательно смотрите задание.")


folding()
