# 5. Программа запрашивает у пользователя строку чисел, разделённых пробелом. При нажатии Enter должна
# выводиться сумма чисел. Пользователь может продолжить ввод чисел, разделённых пробелом и снова нажать
# Enter. Сумма вновь введённых чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введён после нескольких чисел, то вначале нужно добавить сумму этих
# чисел к полученной ранее сумме и после этого завершить программу.

def summ():
    result = 0
    met = False
    while met == False:
        numbers = input("Введите числа через пробел, либо Q для выхода: ").split()
        res = 0
        for el in range(len(numbers)):
            if numbers[el] == 'q' or numbers[el] == 'Q':
                met = True
                break
            else:
                res = res + int(numbers[el])
        result = result + res
        print(f"Сумма всех чисел на текущий момент: {result}")
    print(f"Итоговый результат суммирования: {result}")


summ()
