# 6. Реализовать:
# итератор, генерирующий целые числа, начиная с указанного. Подсказка: используйте функцию
# count() и cycle() модуля itertools. Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Предусмотрите условие его завершения. #### Например, в первом задании выводим целые числа, начиная с 3.
# При достижении числа 10 — завершаем цикл. Вторым пунктом необходимо предусмотреть условие,
# при котором повторение элементов списка прекратится.

from itertools import cycle, count

first = int(input("Начальное значение: "))
last = first * 2 + 10 + 1
for i in count(first):
    if i < last:
        print(i)
    else:
        break
del i
