# 7. Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10% относительно предыдущего. Требуется определить
# номер дня, на который результат спортсмена составит не менее b километров. Программа должна принимать
# значения параметров a и b и выводить одно натуральное число — номер дня.
# Например: a = 2, b = 3.
# Результат:
# 1-й день: 2
# 2-й день: 2,2
# 3-й день: 2,42
# 4-й день: 2,66
# 5-й день: 2,93
# 6-й день: 3,22
# Ответ: на шестой день спортсмен достиг результата — не менее 3 км.

rez = abs(int(input('Сколько должен пробежать спортсмен в первый день? Введите число: ')))
rez_end = abs(int(input('Какой результат должен достичнуть спортсмен? Введите число: ')))
print('Результат 1-го дня: ', rez)
n = 1
while rez < rez_end:
    rez = rez + rez * 0.1
    n += 1
    print(f"Результат {n}-го дня:.", rez)
print(f"На {n}-й день спортсмен достиг результата - не менее {rez_end} км.")