# 3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить, к какому времени года относится месяц
# (зима, весна, лето, осень). Напишите решения через list и dict.

list_1 = ['зима', 'весна', 'лето', 'осень']
dict_1 = {1: 'зима', 2: 'весна', 3: 'лето', 4: 'осень'}
mon = int(input("Введите номер месяца в виде целого числа от 1 до 12: "))

if mon == 1 or mon == 2 or mon == 12:
    print("Указанный номер месяца относится к времени года:", list_1[0], ".")
    print("Указанный номер месяца относится к времени года:", dict_1.get(1), ".")
elif mon == 3 or mon == 4 or mon == 5:
    print("Указанный номер месяца относится к времени года:", list_1[1], ".")
    print("Указанный номер месяца относится к времени года:", dict_1.get(2), ".")
elif mon == 6 or mon == 7 or mon == 8:
    print("Указанный номер месяца относится к времени года:", list_1[2], ".")
    print("Указанный номер месяца относится к времени года:", dict_1.get(3), ".")
elif mon == 9 or mon == 10 or mon == 11:
    print("Указанный номер месяца относится к времени года:", list_1[3], ".")
    print("Указанный номер месяца относится к времени года:", dict_1.get(4), ".")
else:
    print("Введённое число не подходит к условию.")
