# 7. Продолжить работу над заданием. В программу должна попадать строка из слов, разделённых пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре. Нужно сделать вывод исходной строки, но каждое
# слово должно начинаться с заглавной буквы. Используйте написанную ранее функцию int_func().

def int_func(*args):
    slovo = input("Введите строку слов, разделённых пробелами прописными буквами (только латинские буквы): ")
    import re
    if re.search(r'[^a-z, Space]', slovo):
        print("Ввод не корректен! Внимательно читайте задание!")
        return
    print(slovo.title())
    return


int_func()
