# 2. Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых
# больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для его формирования используйте генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].

list_1 = [2, 4, 6, 1, 3, 5, 200, 11, 9, 7, 11, 13, 11]
list_2 = [el for num, el in enumerate(list_1) if list_1[num - 1] < list_1[num]]
print(f'Заданный список: {list_1}')
print(f'Переработанный список: {list_2}')
